package lesson1.task1;

/**
 * Напишите программу, выводящую в консоль It's alive! It's alive!
 * Класс должен называться "Main", это ограничение проверяющей системы.
 *
 * @author Starovoytov
 * @since 02.04.2018
 */
public class Main {
	public static void main(String[] args) {
		System.out.println("It's alive! It's alive!");
	}
}
